package consts

const HelpMsg = `
📁 *Работа со встречами:*
/list - показать список всех встреч
/get <id> - показать транскрипцию встречи
/find <слово/слова> - найти встречи по ключевым словам
• отправь аудио/голосовое - сделать транскрипцию встречи и получить краткую выжимку

🤖 *ИИ-помощник:*
/chat <вопрос> - задать вопрос по встречам
• или просто напиши текст без команды - пойму как вопрос

📚 *Прочие команды:*
/start - начать работу
/help - показать это сообщение
`

const FirstStartMsg = `
Я SoWhatBot - умный помощник для конспектирования встреч.
📌 *Вот что я могу:*
• Отправь аудио файл или голосовое сообщение - сделаю транскрипцию встречи и покажу краткую выжимку
• /list - покажу все твои встречи
• /get <id> - покажу транскрипцию встречи
• /find <слово/слова> - найду встречи по ключевым словам
• /chat <вопрос> - отвечу на вопрос по твоим встречам
Попробуй отправить мне файл или голосовое сообщение со встречи!
`

const WelcomeBackMsg = `
Чем могу помочь?
• Отправь аудио файл или голосовое сообщение - сделаю транскрипцию встречи и покажу краткую выжимку
• /list - покажу все твои встречи
• /get <id> - покажу транскрипцию встречи
• /find <слово/слова> - найду встречи по ключевым словам
• /chat <вопрос> - отвечу на вопрос по твоим встречам
`
